<script>

export default{
  name: 'Home-view',
}
</script>

<template>
  <h2>Кнопки</h2>
    <el-button :param="'lg'">Енот</el-button>
    <el-button :param="'md'">Енот</el-button>
    <el-button :param="'sm'">Енот</el-button>
    <hr>
    <h2>Тайтал</h2>
    <el-title :param="'main'">Енот</el-title>
    <el-title :param="'just'">Енот</el-title>
    <hr>
    <h2>Описание</h2>
    <el-description>Енот-полоскун – удивительное и очаровательное существо с уникальными чертами. Своим внешним видом: пушистым хвостом, наличием "маски" на лице и полосатыми ушами, еноты не оставляют равнодушными ни детей, ни взрослых. Они известны своей ловкостью и хитростью, используя все это для поиска пищи и исследования новой территории. Еноты создают семьи, заботятся о своих детенышах и учат их основам выживания в дикой природе. Они весьма миролюбивы, но при угрозе могут сражаться и выстоять за себя. И за всей этой внешней очаровательностью и милостью, еноты являются дикими животными, которые действуют в соответствии с инстинктами и потребностями природы.</el-description>
    <hr>
    <h2>margin блок</h2>
    <el-block :param="'lg'">555</el-block>
    <el-block :param="'md'">555</el-block>
    <el-block :param="'sm'">555</el-block>
    <hr>
    <h2>Ссылки</h2>
    <el-link :param="'md'">Енот</el-link>
    <el-link :param="'sm'">Енот</el-link>
    <hr>
    <h2>Карточки</h2>
</template>

<style lang='scss' scoped>
 *{
  margin: 8px 25px;
 }
</style>
